import React from 'react';
import Sofia_Capital from "../assets/Sofia_Capital.jpg";
import "../styles/About.css";

function About() {
  return (
    <div className="about">
        <div className="aboutTop" style={{ backgroundImage: `url(${Sofia_Capital})` }}> </div>
        <div className="aboutBottom"> 
            <h1> About </h1>
            <p> София е столицата на България. С около 1 200 000 жители тя е най-големият град в страната с над 18% от нейното общо население, както и 14-ият по големина град в Европейския съюз. Тя е разположена в централната част на Балканския полуостров, в оградената от няколко планини Софийска котловина, която е най-голямото и едно от най-високите Подбалкански полета. Тя заема средищно положение на Балканите, като няколко главни пътя я свързват с другите части на полуострова – през Вакарелската планина към Тракия и Истанбул, през Драгоманския проход към Белград и Централна Европа, по долината на Струма към Гърция и Северна Македония и през няколко прохода в Стара планина към Северна България и Румъния. Източно от града преминава река Искър, а през самия град няколко малки нейни притоци. Първото писмено свидетелство за града е от II век пр. Хр., когато той е главен град на един от тракийските народи. Той се превръща в един от главните опорни центрове на Римската империя на Балканите и през IV век служи за временна резиденция на няколко императори. Градът запазва значението си и през Средновековието, а след XV век преживява нов разцвет, като една от главните логистични бази в тила на Османската империя при нейните военни кампании в Централна Европа. С военното отслабване на Империята от края на XVII век София също запада и през следващите две столетия населението му намалява а много сгради са занемарени или изоставени. През 1879 година, малко след Освобождението на България, градът става столица на новата държава и през следващите десетилетия бързо се разраства.
            </p>
        </div>
    </div>
  )
}

export default About